Обработки/Reports/_ОстаткиИПроцентыЭмиссииЦБВПортфелях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОстаткиИПроцентыЭмиссииЦБВПортфелях</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПороговыйПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьПревышение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОстаткиИПроцентыЭмиссииЦБВПортфелях/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_Формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Период				= ТекущаяДата();
	Отчет.Организация			= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	Отчет.ВыделятьПревышение 	= Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область События_Элементов_Формы

&НаКлиенте
Процедура ПолеУстановитьПроцентПриИзменении(Элемент)
	                      	
	УстановитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область Служебные_Процедуры_и_Функции

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ПороговыйПроцент.Видимость = ЭтаФорма.УстановитьПроцент;
	
КонецПроцедуры

#КонецОбласти

#Область Экспортные_Процедуры_и_Функции

&НаКлиенте
Процедура ПриСменеТекущейОрганизации() Экспорт

	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы["Результат"], "НЕАКТУАЛЬНОСТЬ");
		
КонецПроцедуры

#КонецОбласти
